Server/tests/test-json-xml-util-input01.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<saml2:Assertion xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema" ID="OHT-SAML-ASSERTION" IssueInstant="2017-11-01T00:43:06.0Z" Version="2.0">
<saml2:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName">CN=commonname,OU=org,O=CCS,L=Auburn,ST=NM,C=US</saml2:Issuer>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
<SignedInfo>
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<Reference URI="#OHT-SAML-ASSERTION">
<Transforms>
<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>bje84MPhoI823432t+rdTSp8=</DigestValue>
</Reference>
</SignedInfo>
<SignatureValue>L23423423523454sdfsdgergFDSfdsf+drg7HgG8cvwL
alxZK3BsaT7Ir8HcbUKLUCbQS7Dn2gbTIuvS7IobUvteDxBqr6K1U51WNdZGvWr7BH+cU1uPOVJA
WHf9NTXFadK8INsXR1U=</SignatureValue>
<KeyInfo>
<X509Data>
<X509SubjectName>CN=commonname,OU=org,O=CCS,L=Auburn,ST=NM,C=US</X509SubjectName>
<X509Certificate>MIICMDCCAZkCBEw8c+UwDQYJKoZIhvcNAQEEBQAwXzELMAkGA1UEBhMCVVMxCzAJBgNVBAgTAk5Z
MQ8wDQYDVQQHEwZBdWJ1cm4xDDAKBgNVBAoTA0NDUzEPMA0GA1UECxMGTWVkZW50MRMwEQYDVQQD
Ewp0aW5hYnJpZGdlMB4XDTEwMDcxMzE0MTA0NVoXDTMwMDcwODE0MTA0NVowXzELMAkGA1UEBhMC
saasdlkfjhasdflkjahsdlfkjhaslkdfhjalksjhdflkjh33243lkjhLKJHSLAkjdhwlkjrhwfjd
TWVkZW50MRMwEQYDVQQDEwp0aW5hYnJpZGdlMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCE
sadfasdfkajsdfhkj23hrlkjehdsjfsdlkjh23lkjrsdjfnsdkljfnswkfjhsd;kfjahdfasdflk
OQAA5+qGyPLYzJuOd6zefJeBby736cOHWrD05UUcrFeMmptZSU6uQFpsmxDK9noiKiwKNF5lzscF
asfdkjasdfkhasdkfjhadsfsdflkjhaslkjdhLKJSDHF8S98SFDA8SD98A9DF8A9SDF8A0SDFDSF
ASDF98ASDF9FG9989SA8DF989SDAF9DFASDF0AOSDF0809CX0V90B9DFG08HD98G09DF8G09DF8G
DW7B1fAm2vhAwXniI11SB4DpDOLRKjxyAXWG+mjHKQUNUhi6wr4unaqM2G2XxMSRLOWm</X509Certificate>
</X509Data>
<KeyValue>
<RSAKeyValue>
<Modulus>21341234234SD0F9S0DFSDFSD/oyhudtbOo1uy/zh2o8iNFTRPC+C7QuNMi1wv9o3QkGtIhRYW2Df5
EDkAAOfqhsjy2Mybjnes3NMXgW8u9+nDh1qw9OVFHKxXjJqbWUlOrkBabJsQyvZ6IiosCjReZc7H
BfjqSj1DaiNoAXYiRAU=</Modulus>
<Exponent>AQAB</Exponent>
</RSAKeyValue>
</KeyValue>
</KeyInfo>
</Signature>
<saml2:Subject>
<saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=commonname,OU=org,O=CCS,L=Auburn,ST=NM,C=US</saml2:NameID>
<saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:sender-vouches">
<saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=commonname,OU=org,O=CCS,L=Auburn,ST=NM,C=US</saml2:NameID>
</saml2:SubjectConfirmation>
</saml2:Subject>
<saml2:Conditions NotBefore="2017-11-01T00:43:06.0Z" NotOnOrAfter="2017-11-01T01:43:06.0Z"/>
<saml2:AuthnStatement AuthnInstant="2017-11-01T00:43:06.0Z">
<saml2:SubjectLocality Address="10.158.45.20" DNSName="ahmed"/>
<saml2:AuthnContext>
<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
<saml2:AuthenticatingAuthority>CN=commonname,OU=org,O=CCS,L=Auburn,ST=NM,C=US</saml2:AuthenticatingAuthority>
</saml2:AuthnContext>
</saml2:AuthnStatement>
<saml2:AttributeStatement>
<saml2:Attribute Name="UserName" NameFormat="http://www.hhs.gov/healthit/nhin">
<saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">mrservices@org.com</saml2:AttributeValue>
</saml2:Attribute>
<saml2:Attribute Name="UserOrganization" NameFormat="http://www.hhs.gov/healthit/nhin">
<saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">username</saml2:AttributeValue>
</saml2:Attribute>
<saml2:Attribute Name="UserRole" NameFormat="http://www.hhs.gov/healthit/nhin">
<saml2:AttributeValue>
<nhin:Role xmlns:nhin="http://www.hhs.gov/healthit/nhin" code="112247003" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="Medical Doctor"/>
</saml2:AttributeValue>
</saml2:Attribute>
<saml2:Attribute Name="PurposeForUse" NameFormat="http://www.hhs.gov/healthit/nhin">
<saml2:AttributeValue>
<nhin:PurposeForUse xmlns:nhin="http://www.hhs.gov/healthit/nhin" code="TREATMENT" codeSystem="2.16.840.1.113883.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment"/>
</saml2:AttributeValue>
</saml2:Attribute>
<saml2:Attribute Name="UserRHIO" NameFormat="http://www.NMehealth.org/healthit/shinNM">
<saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">username</saml2:AttributeValue>
</saml2:Attribute>
<saml2:Attribute Name="UserCategory" NameFormat="http://www.NMehealth.org/healthit/shinNM">
<saml2:AttributeValue>
<Category xmlns="http://www.NMehealth.org/healthit/shinNM" code="demo_user_category" codeSystem="CodeSystem" codeSystemName="CodeSystem Name" displayName="Physician"/>
</saml2:AttributeValue>
</saml2:Attribute>
</saml2:AttributeStatement>
</saml2:Assertion>
<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ID="TIMESTAMP" wsu:Id="TIMESTAMP">
<wsu:Created>2017-11-01T00:43:06Z</wsu:Created>
<wsu:Expires>2017-11-01T00:48:06Z</wsu:Expires>
</wsu:Timestamp>
</wsse:Security>
<wsa:To>https://client.myhie.com/pixpdq/PIXManager_Service</wsa:To>
<wsa:ReplyTo>
<wsa:Address>http://www.w3.org/2005/08/addressing/anoNMmous</wsa:Address>
</wsa:ReplyTo>
<wsa:MessageID>urn:uuid:325103b0-9250-9a92-7f47-85ebd22d4bb1</wsa:MessageID>
<wsa:Action>urn:hl7-org:v3:PRPA_IN201301UV02</wsa:Action>
</soapenv:Header>
<soapenv:Body>
<v3:PRPA_IN201301UV02 xmlns:v3="urn:hl7-org:v3" ITSVersion="XML_1.0">
<v3:id root="{SOURCE_OID}.108041070040052259.1509496986099.54"/>
<v3:creationTime value="20171031204306"/>
<v3:interactionId extension="PRPA_IN201301UV02" root="2.16.840.1.113883.1.6"/>
<v3:processingCode code="P"/>
<v3:processingModeCode code="T"/>
<v3:acceptAckCode code="AL"/>
<v3:receiver typeCode="RCV">
<v3:device classCode="DEV" determinerCode="INSTANCE">
<v3:id root="{SITE_OID}"/>
</v3:device>
</v3:receiver>
<v3:sender typeCode="SND">
<v3:device classCode="DEV" determinerCode="INSTANCE">
<v3:id root="{SOURCE_OID}"/>
</v3:device>
</v3:sender>
<v3:controlActProcess classCode="CACT" moodCode="EVN">
<v3:code code="PRPA_TE201301UV02" codeSystem="2.16.840.1.113883.1.18"/>
<v3:subject typeCode="SUBJ">
<v3:registrationEvent classCode="REG" moodCode="EVN">
<v3:id nullFlavor="NA"/>
<v3:statusCode code="active"/>
<v3:subject1 typeCode="SBJ">
<v3:patient classCode="PAT">
<v3:id assigningAuthorityName="org name" extension="{PATIENT_ID}" root="{SOURCE_OID}"/>
<v3:statusCode code="active"/>
<v3:patientPerson classCode="PSN" determinerCode="INSTANCE">
<v3:name>
<v3:family>{LAST_NAME}</v3:family>
<v3:given>{FIRST_NAME}</v3:given>
</v3:name>
<v3:telecom use="HP" value="tel:{PHONE_NUMBER}"/>
<v3:administrativeGenderCode code="{GENDER}" codeSystem="2.16.840.1.113883.5.1"/>
<v3:birthTime value="{DOB}"/>
<v3:addr>
<v3:streetAddressLine>{STREET_ADDRESS}</v3:streetAddressLine>
<v3:city>{CITY}</v3:city>
<v3:state>{STATE}</v3:state>
<v3:postalCode>{POSTAL_CODE}</v3:postalCode>
</v3:addr>
</v3:patientPerson>
<v3:providerOrganization classCode="ORG" determinerCode="INSTANCE">
<v3:id root="{SOURCE_OID}"/>
<v3:name>org name</v3:name>
<v3:contactParty classCode="CON">
<v3:telecom value=""/>
</v3:contactParty>
</v3:providerOrganization>
</v3:patient>
</v3:subject1>
<v3:custodian typeCode="CST">
<v3:assignedEntity classCode="ASSIGNED">
<v3:id root="{SOURCE_OID}"/>
<v3:assignedOrganization classCode="ORG" determinerCode="INSTANCE">
<v3:name>org name</v3:name>
</v3:assignedOrganization>
</v3:assignedEntity>
</v3:custodian>
</v3:registrationEvent>
</v3:subject>
</v3:controlActProcess>
</v3:PRPA_IN201301UV02>
</soapenv:Body>
</soapenv:Envelope>